
def area(a):
    '''
    Функция, находящая площадь квадрата с заданной стороной.
        
        Параметры:
            a (int, float, etc...) - число (сторона квадрата)
        
        Возвращаемое значение:
            area (int, float, etc...) - площадь квадрата с данной стороной, высчитанная по математической формуле
            
    Пример вызова функции:
        area(2) -> 4
    '''
    return a * a


def perimeter(a):
    '''
    Функция, находящая периметр квадрата с заданной стороной.
        
        Параметры:
            a (int, float, etc...) - число (сторона квадрата)
        
        Возвращаемое значение:
            perimeter (int, float, etc...) - периметр квадрата с данной стороной, высчитанный по математической формуле
            
    Пример вызова функции:
        area(3) -> 12
    '''
    return 4 * a
